const dictionary: {[key: string]: string} = {
  маша: "Машенька",
  мария: "Машенька",
  maria: "Машенька",
  marii: "Машенька",
  mary: "Машенька",
  masha: "Машенька",

  марью: "Марьюшка",
  марья: "Марьюшка",

  марин: "Мариночка",
  marin: "Мариночка",

  алин: "Алиночка",
  alin: "Алиночка",

  alyon: "Алёночка",
  алена: "Алёночка",
  алёна: "Алёночка",

  уль: "Ульяночка",
  ulya: "Ульяночка",

  anast: "Настечка",
  nastya: "Настечка",
  настя: "Настечка",
  анаст: "Настечка",

  polin: "Полиночка",
  полин: "Полиночка",

  alisa: "Алисочка",
  alice: "Алисочка",
  алиса: "Алисочка",
  алис: "Алисочка",

  sonya: "Сонечка",
  соня: "Сонечка",
  софи: "Сонечка",
  sophi: "Сонечка",
  sofi: "Сонечка",

  viktoria: "Викочка",
  виктория: "Викочка",
  вика: "Викочка",
  vika: "Викочка",

  ann: "Анечка",
  anya: "Анечка",
  анна: "Анечка",
  аня: "Анечка",

  александра: "Сашенька",
  сашенька: "Сашенька",

  luda: "Людочка",
  ludmi: "Людочка",
  люда: "Людочка",
  людми: "Людочка",

  юля: "Юлечка",
  юлия: "Юлечка",
  yulia: "Юлечка",
  yulya: "Юлечка",

  elen: "Леночка",
  елен: "Леночка",
  лена: "Леночка",
  lena: "Леночка",

  арин: "Ариночка",
  arin: "Ариночка",

  эвел: "Эвелиночка",
  evil: "Эвелиночка",

  elisa: "Лизочка",
  елиза: "Лизочка",
  liza: "Лизочка",
  lizoch: "Лизочка",
  eliz: "Лизочка",
  лиза: "Лизочка",

  daria: "Дашечка",
  dasha: "Дашечка",
  даша: "Дашечка",
  дарья: "Дашечка",

  ксен: "Ксеня",
  ksen: "Ксеня",

  оля: "Олечка",
  ольг: "Олечка",
  olga: "Олечка",
  olya: "Олечка",

  katya: "Катечка",
  ekate: "Катечка",
  cathe: "Катечка",
  екат: "Катечка",
  катя: "Катечка",
  катерина: "Катечка",
  кате: "Катечка",

  eva: "Евочка",
  ева: "Евочка",

  крист: "Кристиночка",
  christi: "Кристиночка",
  kristi: "Кристиночка",

  lera: "Лерочка",
  лера: "Лерочка",

  макс: "Максик",
  максим: "Максик",
  maxim: "Максик",

  unknown: "",
};

export default dictionary;
